{
  "common.description": "As a cross-functional team leader, I have designed and implemented data-driven decision-making systems that directly contribute to business value. With a strong focus on user needs and agile execution, I deliver value from both technical and project management perspectives.",
  "common.name": "YeongHo Kim",
  "common.position": "Full Stack Developer",
  "project.datetime.bmob": "11/5/2021 - 3/1/2022",
  "project.datetime.daily_hangeul": "July - August 2024",
  "project.datetime.hangangnow": "July - September 2022",
  "project.datetime.knu_social": "January 2023",
  "project.datetime.knumarket": "6/21 - 11/15, 2021",
  "project.datetime.lovydovy": "AUG - SEP 2024",
  "project.description.bmob": "Be Mobility Better!",
  "project.description.daily_hangeul": "Deep thinking starting with short texts",
  "project.description.hangangnow": "All the knowledge you need for a trip to the Han River",
  "project.description.knu_social": "Social Sciences University Online Reservation System",
  "project.description.knumarket": "Where we buy together!",
  "project.description.lovydovy": "AI chat with your favorite character",
  "project.more.contents": "Smart Farm Dashboard Development (Graduate Collaboration Project, Kyungpook National University, Jul 2021)\\n[Html, CSS, JavaScript]\\n\\nSimcheong-i: Errand Service App Planning & Development (WIM Inc., Jun–Sep 2021)\\n[Android, Java, Firebase, AdobeXD, Figma]\\n\\nElderly Care Smart City Platform UI Development (Consortium of 10 Companies, Sep 2021 – May 2022)\\n[React, TypeScript]\\n\\nINCLE: Fashion Marketplace Planning & Admin Frontend Development (WIM Inc., Dec 2021 – Apr 2022)\\n[AdobeXD, React, TypeScript]\\n\\nWIM Inc. Website Planning & Development (WIM Inc., Jan–Mar 2022)\\n[AdobeXD, React, TypeScript]\\n\\nBlack Ice: Vision-AI Road Condition Analysis System Planning (WIM Inc., Feb 2022)\\n[AdobeXD]\\n\\nKyungpook National University Hospital Payment System UI Dev. / Project Manager (J-Solution, Feb–Jun 2022)\\n[React, TypeScript]\\n\\nRobot Control Mobile App Development (WIM Inc. & Korea Institute for Robot Industry Advancement, Mar 2022)\\n[Android, Java]\\n\\nWooYoo Market: Price Comparison Platform Planning (WIM Inc., Jun 2022)\\n[AdobeXD]\\n\\nCompleted mandatory military service (Sep 2022 – Mar 2024)\\n\\nStocodi: Economic Education Platform - Lead Developer (KNU Club, Mar–May 2024)\\n[Next.js, TypeScript, Spring Boot, Java]\\n\\nMaum TokTok: OpenAI-based Counseling Platform (Personal Project, Apr–Jun 2024)\\n[React, TypeScript, Firebase, Node.js, SwiftUI]\\n\\nWIMMY: KakaoTalk-based Chatbot Server & Admin UI Dev. (WIM Inc., Feb 2025)\\n[Python, ElasticSearch, React, TypeScript]\\n\\nMyData: LLM-based AI Assistant Platform (WIM Inc., Feb–Apr 2025)\\n[Spring Boot, Kotlin, React, TypeScript, Python3, FastAPI, LangGraph, PGVector-RAG]\\n\\nCodeMeter: Code Project Review & Analysis Platform (WIM Inc., Apr 2022–Present)\\n[Spring Boot, Kotlin, NestJS, SonarQube, Python, LangGraph, React, TypeScript]",
  "project.more.label": "want to know more?",
  "project.paragraph.bmob": "It was my first time working in the React ecosystem after developing in Android/Kotlin. While learning a new language and framework was challenging, I rapidly improved through hands-on problem solving and refactoring. As the development team leader, I also managed the project and participated in planning. Some early design ideas were not technically feasible due to a lack of clear functional definitions and ERD understanding, which led me to realize the importance of detailed planning and QA. This experience strengthened my cross-functional perspective beyond coding.",
  "project.paragraph.daily_hangeul": "Haruhangul was a team project developed during the 2024 LikeLion Hackathon, where I led frontend development and deployment using GCP and Nginx. The biggest challenge was delivering a stable, high-quality service within a short timeframe. To address this, I reused previously built components and clearly communicated API requirements from a frontend perspective to backend developers. This approach significantly shortened the development timeline. Through this experience, I learned the importance of rapid problem-solving, cross-functional collaboration, and bridging the gap between planning and execution.",
  "project.paragraph.hangangnow": "Since there was no module available for implementing Kakao Map in React Native, I developed it by displaying a web version built with React through a WebView. It was a really enjoyable experience handling everything from event processing to data requests while switching between React Native and React.\\nAs the deadline was very tight, our planners and designers had a hard time, but it was a valuable experience that taught me both the importance and difficulty of working together as a team to meet deadlines.",
  "project.paragraph.knu_social": "I enjoyed developing this app with the motivation to provide a useful service for Kyungpook National University students. One major challenge was creating a wireframe from loosely defined natural-language requests made during meetings. It was difficult to fully grasp what the client truly wanted. To resolve this, I introduced a visual feedback cycle where I regularly shared mockups and refined them iteratively. This experience taught me the importance of clear requirement definitions and how crucial communication is in software development.",
  "project.paragraph.knumarket": "In the KnuMarket project, I found great value in working with a team of planners, designers, and backend engineers to solve problems together. The most challenging part was developing the chat feature. I initially lacked proper architectural planning, which led to a bug where new messages mixed with old ones due to asynchronous API and WebSocket calls. Debugging was impossible under the existing structure, so I refactored the module using the MVVM architecture and DI pattern. Through this, I learned the importance of system design and the value of structured development approaches.",
  "project.paragraph.lovydovy": "Through this project, I challenged myself for the first time to develop not only the frontend using React and React Native but also the backend using Node.js and Firebase Functions. At first, it was difficult to grasp backend-specific concepts like API design, networking, databases, and ORM, which are quite different from frontend development. However, I tackled these challenges by reading documentation and experimenting with real code. This hands-on approach allowed me to build a deeper understanding of platform architecture. Ultimately, the experience helped me realize the value of full-stack perspective and greatly strengthened my development versatility.",
  "project.skills.title": "Technology Stack",
  "project.tools.title": "Tool",
  "resume.education.KNU.datetime": "March 2020 - March 2027",
  "resume.education.KNU.title": "Kyungpook National University \\nComputer Science Department Bachelor's degree expected",
  "resume.education.TU.datetime": "APR - JUN 2024",
  "resume.education.TU.title": "Univ. Of Tokushima\\nStudent Exchange Program in\\nIntelligent Information Course",
  "resume.education.title": "Education",
  "resume.info.address.description": "AZUR 202, Tokushima University Affiliated International Exchange Dormitory\\n 5-21 Sukenobu Honcho 5-chome, Tokushima-shi, Tokushima, Japan",
  "resume.info.address.title": "address",
  "resume.info.email.description": "kimyoungho0415@gmail.com",
  "resume.info.email.title": "email",
  "resume.info.github.description": "https://github.com/kanei0415",
  "resume.info.github.title": "Github",
  "resume.info.phone.description": "+81) 090-8129-4190",
  "resume.info.phone.title": "contact",
  "resume.info.title": "information",
  "resume.skills.development.description": "Full-Stack Web Development: React / Next.js, Spring Boot (Kotlin), TypeScript\\nCross-Platform Mobile App Development: React Native, Expo, Android (Java)\\nAPI Design & Integration: RESTful API, Firebase Functions, Swagger/OpenAPI\\nSecure Cloud Backend Implementation: AWS (EC2, S3, KMS), GCP (Compute Engine, IAM)\\nContainerization & Deployment: Docker, Docker Compose, Nginx, Cloudflare\\nRAG Architecture Development: LangChain, LangGraph, PGVector, OpenAI API\\nGraph Database Design: Neo4j, CypherQL, vector-based similarity search\\nCI/CD & DevOps Practices: GitHub Actions, Shell scripting, Monitoring/Logging\\nScalable Architecture Design: Monorepo, microservices, secure API endpoints\\nPerformance Optimization & A/B Testing: Google Analytics, Lighthouse, Heap",
  "resume.skills.development.title": "development",
  "resume.skills.language.description": "Korean – Native\\nJapanese – Fluent (JLPT N1)\\nEnglish – Professional (TOEIC 915)",
  "resume.skills.language.title": "language",
  "resume.skills.project.bmob": "BMOB",
  "resume.skills.project.daily_hangeul": "DailyHangeul",
  "resume.skills.project.hangangnow": "HangangNow",
  "resume.skills.project.knu_social": "Sokterdi Room",
  "resume.skills.project.knumarket": "Knumarket",
  "resume.skills.project.lovydovy": "LovyDoby",
  "resume.skills.project.title": "Project",
  "resume.skills.title": "Skill",
  "resume.work_experience.company.tainai": "TAIN AI Co., Ltd.",
  "resume.work_experience.company.wim": "Wim Corporation",
  "resume.work_experience.datetime.internship": "AUG ~ SEP 2022",
  "resume.work_experience.datetime.tainai": "APR ~ JUN 2024",
  "resume.work_experience.datetime.wim": "SEP 2022~ JUL 2025",
  "resume.work_experience.description.internship": "During my summer internship at WIM, I participated in a client-facing project using agile methodology. I led product development throughout the full production lifecycle, including QA and quality management. I conducted meetings and presentations with external stakeholders and initiated the team’s first sprint-based workflow to improve communication efficiency in weekly meetings. Additionally, I contributed as a React and React Native developer in the project.",
  "resume.work_experience.description.tainai": "At TainAI, I contributed to the development of the \"LoveyDovey\" app by collaborating with the marketing team, achieving KPIs of 50,000 sign-ups and 4,000 paying users through organic growth. I led the implementation of multilingual support and multi-currency payment systems. Based on user feedback, I introduced an adult conversation mode and proposed UI enhancements to reduce confusion in in-app currency and cross-currency transactions. I also participated in a global team to deploy a translation solution supporting both Japanese and English for the mobile app.",
  "resume.work_experience.description.wim": "At WIM, I served as both a frontend developer using React and React Native and a project manager for outsourced development. I have experience delivering products to institutions such as Kyungpook National University Hospital and Seongju City Hall. I am also engaged in full-stack development using Spring Boot, and have built an agentic system that processes natural language through a PGVector-based RAG architecture. I manage CI pipelines using Docker and TeamCity, and have led a team consisting of 2 backend engineers, 3 frontend developers, and 1 designer.",
  "resume.work_experience.title": "Work Experience",
  "resume.work_experience.work.full_stack_developer": "Full Stack Developer",
  "resume.work_experience.work.internship": "Internship Program",
  "resume.work_experience.work.part_time": "Contract worker"
}
